{
  "_name_or_path": "bert-base-uncased",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Psoriasis",
    "1": "Varicose Veins",
    "2": "Typhoid",
    "3": "Chicken pox",
    "4": "Impetigo",
    "5": "Dengue",
    "6": "Fungal infection",
    "7": "Common Cold",
    "8": "Pneumonia",
    "9": "Dimorphic Hemorrhoids",
    "10": "Arthritis",
    "11": "Acne",
    "12": "Bronchial Asthma",
    "13": "Hypertension",
    "14": "Migraine",
    "15": "Cervical spondylosis",
    "16": "Jaundice",
    "17": "Malaria",
    "18": "urinary tract infection",
    "19": "allergy",
    "20": "gastroesophageal reflux disease",
    "21": "drug reaction",
    "22": "peptic ulcer disease",
    "23": "diabetes",
    "24": "cancer_general",
    "25": "cancer_types",
    "26": "cancer_symptoms",
    "27": "cancer_prevention",
    "28": "diabetes_general",
    "29": "diabetes_types",
    "30": "diabetes_symptoms",
    "31": "diabetes_prevention",
    "32": "alzheimers_general",
    "33": "alzheimers_types",
    "34": "alzheimers_symptoms",
    "35": "alzheimers_prevention",
    "36": "hypertension_general",
    "37": "hypertension_types",
    "38": "hypertension_symptoms",
    "39": "hypertension_prevention",
    "40": "stroke_general",
    "41": "stroke_types",
    "42": "stroke_symptoms",
    "43": "stroke_prevention",
    "44": "morning",
    "45": "afternoon",
    "46": "evening",
    "47": "night",
    "48": "thanks",
    "49": "no-response",
    "50": "neutral-response",
    "51": "skill",
    "52": "help",
    "53": "sad",
    "54": "stressed",
    "55": "greeting",
    "56": "goodbye",
    "57": "creator",
    "58": "name",
    "59": "hours",
    "60": "number",
    "61": "fees",
    "62": "location",
    "63": "worthless",
    "64": "happy",
    "65": "casual",
    "66": "not-talking",
    "67": "sleep",
    "68": "death",
    "69": "understand",
    "70": "done",
    "71": "suicide",
    "72": "hate-you",
    "73": "greeting2",
    "74": "formal_greeting",
    "75": "friendly_greeting",
    "76": "creative_greeting"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Acne": 11,
    "Arthritis": 10,
    "Bronchial Asthma": 12,
    "Cervical spondylosis": 15,
    "Chicken pox": 3,
    "Common Cold": 7,
    "Dengue": 5,
    "Dimorphic Hemorrhoids": 9,
    "Fungal infection": 6,
    "Hypertension": 13,
    "Impetigo": 4,
    "Jaundice": 16,
    "Malaria": 17,
    "Migraine": 14,
    "Pneumonia": 8,
    "Psoriasis": 0,
    "Typhoid": 2,
    "Varicose Veins": 1,
    "afternoon": 45,
    "allergy": 19,
    "alzheimers_general": 32,
    "alzheimers_prevention": 35,
    "alzheimers_symptoms": 34,
    "alzheimers_types": 33,
    "cancer_general": 24,
    "cancer_prevention": 27,
    "cancer_symptoms": 26,
    "cancer_types": 25,
    "casual": 65,
    "creative_greeting": 76,
    "creator": 57,
    "death": 68,
    "diabetes": 23,
    "diabetes_general": 28,
    "diabetes_prevention": 31,
    "diabetes_symptoms": 30,
    "diabetes_types": 29,
    "done": 70,
    "drug reaction": 21,
    "evening": 46,
    "fees": 61,
    "formal_greeting": 74,
    "friendly_greeting": 75,
    "gastroesophageal reflux disease": 20,
    "goodbye": 56,
    "greeting": 55,
    "greeting2": 73,
    "happy": 64,
    "hate-you": 72,
    "help": 52,
    "hours": 59,
    "hypertension_general": 36,
    "hypertension_prevention": 39,
    "hypertension_symptoms": 38,
    "hypertension_types": 37,
    "location": 62,
    "morning": 44,
    "name": 58,
    "neutral-response": 50,
    "night": 47,
    "no-response": 49,
    "not-talking": 66,
    "number": 60,
    "peptic ulcer disease": 22,
    "sad": 53,
    "skill": 51,
    "sleep": 67,
    "stressed": 54,
    "stroke_general": 40,
    "stroke_prevention": 43,
    "stroke_symptoms": 42,
    "stroke_types": 41,
    "suicide": 71,
    "thanks": 48,
    "understand": 69,
    "urinary tract infection": 18,
    "worthless": 63
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.46.3",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
